brew 'zsh'
brew 'bash'
brew 'stow'
brew 'git'

brew 'neovim'
brew 'ripgrep'
brew 'tmux'
brew 'fzf'

brew 'make'
brew 'cmake' 
brew 'gh'
brew 'jq'
brew 'parallel'
brew 'starship'
brew 'wget'  
brew 'curl'

brew 'asdf'
brew 'gcc'
brew 'llvm'
brew 'python'
brew 'go'
brew 'lua'
brew 'luarocks'

brew 'node'
brew 'npm'
brew 'typescript'
brew 'typescript-language-server'
brew 'eslint'
brew 'pnpm'

cask 'font-jetbrains-mono'
cask 'font-jetbrains-mono-nerd-font'
